WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/kerneltests/ana_to_dig_conv_tests.c
  // Set sample time for channels 0-9
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_SMPR2_OFFSET);
  regval &= 0xc0000000;      // Clear sample time fields 0-9
  regval |= ADC_SMPR2_DEFAULT;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_SMPR2_OFFSET);

  //------------------------------------------------------------
  // ADC_SQR1, ADC_SQR2 and ADC_SQR3 are used to configure the sequence of the
  // conversions. If there are no entries then nothing will be converted.
  // Basically, which input in which order.
  //
  // The values put in this field are found by looking at the target hardware.
  // For the FeatherV2, A00 is PA4. Next look at the data sheet
  // 'Table 11. STM32F777xx, STM32F778Ax and STM32F779xx pin and ball
  // definitions.' In the 'Pin name' column find PA4. Then look in the
  // 'Additional functions' column for the possible analog inputs for the ADC
  // being used. In this case there are 2 possible ADC1_IN4, and ADC2_IN4.
  // Since for ADC1 the value is '4' (it's also 4 for ADC2 and 3).
  //
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_SQR3_OFFSET);
  //? regval &= ADC_SQR3_RESERVED;   // Clear all SQR Bits
 
  // All 6 Pins available
  regval |= (4  << ADC_SQR3_SQ1_SHIFT);   // Channel 4  - A00 [PA4]->ADC123_IN4
  regval |= (5  << ADC_SQR3_SQ2_SHIFT);   // Channel 5  - A01 [PA5]->ADC123_IN5
  regval |= (3  << ADC_SQR3_SQ3_SHIFT);   // Channel 3  - A02 [PA3]->ADC123_IN3
  regval |= (8  << ADC_SQR3_SQ4_SHIFT);   // Channel 8  - A03 [PB0]->ADC12_IN8
  regval |= (9  << ADC_SQR3_SQ5_SHIFT);   // Channel 9  - A04 [PB1]->ADC12_IN9
  regval |= (10 << ADC_SQR3_SQ6_SHIFT);   // Channel 10 - A05 [PC0]->ADC123_IN10
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_SQR3_OFFSET);

  // FOR TESTING - Hookup all 16 ADC Input and try to determine what's going
  // on
  // SQR3 has first 1 - 6 
  // regval |= (1  << ADC_SQR3_SQ1_SHIFT);   // Channel 1
  // regval |= (2  << ADC_SQR3_SQ2_SHIFT);   // Channel 2
  // regval |= (3  << ADC_SQR3_SQ3_SHIFT);   // Channel 3
  // regval |= (4  << ADC_SQR3_SQ4_SHIFT);   // Channel 4
  // regval |= (5  << ADC_SQR3_SQ5_SHIFT);   // Channel 5
  // regval |= (6  << ADC_SQR3_SQ6_SHIFT);   // Channel 6
  // putreg32(regval, baseADCAddr + STM32_ADC_SQR3_OFFSET);

  // // SQR2 has first 7 - 12
  // regval = getreg32(baseADCAddr + STM32_ADC_SQR2_OFFSET);
  // regval &= ADC_SQR2_RESERVED;            // Clear all SQR Bits
  // regval |= (7  << ADC_SQR2_SQ7_SHIFT);    // Channel 7
  // regval |= (8  << ADC_SQR2_SQ8_SHIFT);    // Channel 8
  // regval |= (9  << ADC_SQR2_SQ9_SHIFT);    // Channel 9
  // regval |= (10  << ADC_SQR2_SQ10_SHIFT);  // Channel 10
  // regval |= (11  << ADC_SQR2_SQ11_SHIFT);  // Channel 11
  // regval |= (12  << ADC_SQR2_SQ12_SHIFT);  // Channel 12
  // putreg32(regval, baseADCAddr + STM32_ADC_SQR2_OFFSET);

  // // And SQR1 has last 13 - 16 and the length (total conversions in sequence)
  // regval = getreg32(baseADCAddr + STM32_ADC_SQR1_OFFSET);
  // regval &= ADC_SQR1_RESERVED;            // Clear all SQR Bits
  // regval |= (13 << ADC_SQR1_SQ13_SHIFT);   // Channel 13
  // regval |= (14 << ADC_SQR1_SQ14_SHIFT);   // Channel 14
  // regval |= (15 << ADC_SQR1_SQ15_SHIFT);   // Channel 15
  // regval |= (16 << ADC_SQR1_SQ16_SHIFT);   // Channel 16
  // regval |= (15 << ADC_SQR1_L_SHIFT);      // A 15 will convert 16 inputs

  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_SQR1_OFFSET);
  //? regval &= ADC_SQR1_RESERVED;            // Clear all SQR Bits
  regval |= (5 << ADC_SQR1_L_SHIFT);       // A 5 will convert 6
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_SQR1_OFFSET);

  // // Wake up internal temperature sensor
  // regval = getreg32(STM32_ADC_CCR);
  // regval |= ADC_CCR_TSVREFE;
  // putreg32(regval, STM32_ADC_CCR);

  // (--) WHY NOT WITH OTHER CR2 CONFIGS?
  // Enable DMA of ADC
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  // DDS may only be for single ADC mode  (may be only when not using sequence???)
  // but comments 15.8.1 ony double buffered circular mode
  regval |= ADC_CR2_DDS;          // 1=Enable DMA Disable Selection
  regval |= ADC_CR2_DMA;          // 1=Enable DMA
  regval |= ADC_CR2_CONT;         // 1=Enable continuous mode
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
}

//================================================================
// Enable ADC
static void adc_enable(void)
{
  uint32_t regval;

  // Set ADON to turn on this ADC
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval |= ADC_CR2_ADON;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

  // Wait a bit
  usleep(400);
}

//================================================================
// Start ADC
static void adc_start(void)
{
  uint32_t regval;
  
  regval  = getreg32(STM32_ADC1_BASE + STM32_ADC_SR_OFFSET);
  regval = 0;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_SR_OFFSET);

  // Start conversion
  regval  = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval |= ADC_CR2_SWSTART;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
}

//================================================================
// Initialize DMA
static void dma_initialize(void)
{
  uint32_t regval;

// FOR DMA-SEEMS TO BE NO DIFFERENCE BETWEEN NUTTX AND DIRECT REGISTER VERSIONS
#if (1)   // Use Nuttx code
  // // Using Nuttx DMA module to handle DMA setup
  // if(_dmaHandle != NULL)
  // {
  //   // Needed only if previous dma being modified.
  //   stm32_dmastop(_dmaHandle);
  //   stm32_dmafree(_dmaHandle); 
  // }
  _dmaHandle = stm32_dmachannel(DMAMAP_ADC1_1);

  // Configure the DMA SCR (Stream Control Register) values
  regval = getreg32(STM32_DMA2_S0CR);
  regval =  DMA_SCR_MSIZE_16BITS;   // Size of memory transfer
  regval |= DMA_SCR_PSIZE_16BITS;   // Size of peripheral transfer
  // Memory increment mode. 0=mem addr is fixed, 1=mem addr increments
  regval |= DMA_SCR_MINC;           // Mem Increment
  regval |= DMA_SCR_CIRC;           // Circular mode 1=enabled
  regval |= DMA_SCR_DIR_P2M;        // Direction 0=Perph->Mem

