WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/kerneltests/ana_to_dig_conv_tests.c
#if ADC_TESTS_USE_DOUBLE_BUFFERING > 0
  // For double-buffered add DMA_SCR_DBM to regval, the second buffer must be
  // follow the first in memory, so a double sized buffer is needed.
  // Internal to stm32_dmasetup() it sets the second buffer memory addr
  // based on the address of the one supplied + the buffer size.
  regval |= DMA_SCR_DBM;            // Double buffered mode
#endif

  // SxNDTR is set by Nuttx
  stm32_dmasetup(_dmaHandle,
                 STM32_ADC1_BASE + STM32_ADC_DR_OFFSET, // Peripheral addr
                 (uint32_t)_dmaDataBuffer1,         // Mem addr
                 ADC_TESTS_DMA_DATA_BUFFER_SIZE,    // number of transfers
                 regval);

  // Provide DMA callback
  // void *arg will be returned via callback to ISR
  // true/false for half buffer callback as well as full buffer.
  stm32_dmastart(_dmaHandle, adc_dma_interrupt_handler_isr,
            (void *)STM32_ADC1_BASE, false);
#else
//------------------------------------------------------------
  // (--) PLAN B - Stop using Nuttx DMA code
  // Use direct register code
  // ADC1 DMA can be found here:DMA2, DMA_STREAM0, DMA_CHAN0
  // regval = getreg32(STM32_DMA2_S0CR);
  // regval &= ~DMA_SCR_EN;      // Clear the enable bit
  // putreg32(regval, STM32_DMA2_S0CR);

  // // Per Ref Man 8.3.18 must wait till 0
  // while ((getreg32(STM32_DMA2_S0CR) & DMA_SCR_EN) != 0);

  // Insure the DMA clock is on.
  regval = getreg32(STM32_RCC_APB1ENR);
  regval |= RCC_AHB1ENR_DMA2EN;
  putreg32(regval, STM32_RCC_APB1ENR);

  // Offset to DMA2 Stream 0 Control Register
  regval = getreg32(STM32_DMA2_S0CR);
  
  // Clear all the bits that can be set
  regval &= 0xe0000000;
  // NOT NEEDED HERE IT'S DONE BELOW
  putreg32(regval, STM32_DMA2_S0CR);

  // Select the Channel 0 by clearing (0000)
  // DIFFERENCE?? SAMPLE USES 0x7 DMA_SCR_CHSEL_MASK IS 0xf
  regval &= ~(7<<DMA_SCR_CHSEL_SHIFT);

  // (--) Trying Double-Buffer mode
  // The CT bit reveals which buffer is being filled
  // CT = 0 -> Memory 0
  // CT = 1 -> Memory 1  
  // regval |= DMA_SCR_DBM;
  // (--) Trying Double-Buffer mode
  // Set the memory size (MSIZE) is 16-bits 01
  // regval &= ~DMA_SCR_MSIZE_MASK;    // Clear both bits
  regval |= DMA_SCR_MSIZE_16BITS;   // Set size
  // Set the peripheral size (PSIZE) is 16-bits 01 
  // regval &= ~DMA_SCR_PSIZE_MASK;    // Clear both bits
  regval |= DMA_SCR_PSIZE_16BITS;   // Set size
  // Enable Memory Address Increment (MINC)
  // PINC is left 0 to not increment
  regval |= DMA_SCR_MINC;   // For 16-bit values incrementes by 2
  // Set Circular mode
  regval |= DMA_SCR_CIRC;
  // Set direction as Peripheral to Memory
  regval &= ~DMA_SCR_DIR_MASK;    // Clear both bits
  regval |= DMA_SCR_DIR_P2M;
  putreg32(regval, STM32_DMA2_S0CR);
  // Per Ref Man 8.3.18 must wait
  // while ((getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET) & ADC_CR2_ADON) != 0);

  // DMA2 Channel 0 Number of Data Transfer Register
  regval = getreg32(STM32_DMA2_S0NDTR);
  // regval &= ~0x0000ffff;      // Clear 15:0
  // // regval |= xferSize;
  regval = ADC_TESTS_DMA_DATA_BUFFER_SIZE;
  putreg32(regval, STM32_DMA2_S0NDTR);

  // DMA2 Channel 0 Peripheral Register
  regval = getreg32(STM32_DMA2_S0PAR);
  // regval = sourceAddr;
  regval = STM32_ADC1_BASE + STM32_ADC_DR_OFFSET;
  putreg32(regval, STM32_DMA2_S0PAR);

  // DMA2 Channel 0 Memory Address Register 0
  regval = (uint32_t)_dmaDataBuffer1;
  putreg32(regval, STM32_DMA2_S0M0AR);

#if ADC_TESTS_USE_DOUBLE_BUFFERING > 0
  // Setup alternate buffer's address
  // DMA2 Channel 0 Memory Address Register 1
  regval = _dmaDataBuffer2;
  putreg32(regval, STM32_DMA2_S0M1AR);
#endif

  // (--) CALLING DMA ISR NEED WORK-THE CODE TO ASSIGN THE ISR ISN'T WRITTEN
  // //       1/2 full         full          transfer err  Direct Mode err
  // regval = getreg32(STM32_DMA2_S0CR);
  // regval |= DMA_SCR_HTIE | DMA_SCR_TCIE | DMA_SCR_TEIE | DMA_SCR_DMEIE;
  // putreg32(regval, STM32_DMA2_S0CR);

  // Enable DMA Stream.
  regval = getreg32(STM32_DMA2_S0CR);
  regval |= DMA_SCR_EN;
  putreg32(regval, STM32_DMA2_S0CR);

#endif    // #if ADC_TESTS_USE_DMA_TRANSFER > 0
}

//================================================================
// Entry point
  // (--) This part of the code could be called > 1 time when it supports more
  // than ADC1 for debugging. However the ADC reset done via RCC will only
  // need to be done once.
  // nuttx/arch/arm/src/stm32f7/chip/stm32f74xx77xx_adc.h
void adc_test_initialize_adc(int adc_numb)
{
  int ret;
  static bool firstTime = true;
  
  if(firstTime)
  {
    firstTime = false;
    
    stm32_configgpio(GPIO_V2_A00_IN4_PA4);
    stm32_configgpio(GPIO_V2_A01_IN5_PA5);
    stm32_configgpio(GPIO_V2_A02_IN3_PA3);
    stm32_configgpio(GPIO_V2_A03_IN8_PB0);
    stm32_configgpio(GPIO_V2_A04_IN9_PB1);
    stm32_configgpio(GPIO_V2_A05_IN10_PC0);
  }
  else
  {
    syslog(1, "Please, only once\n");
    return;
  }

  syslog(1, "--> Entered adc_test_initialize_adc() ADC is:%d (1-3 valid)\n", adc_numb); usleep(20 * 1000);

#if ADC_TESTS_USE_DMA_TRANSFER > 0
  _dmaHandle = NULL;
#endif

  // Setup the ADC Interrupt handler
  ret = irq_attach(STM32_IRQ_ADC, adc_conversion_interrupt_handler_isr,
            (void *)STM32_ADC1_BASE);
  if(ret < 0)
  {
    syslog(1, "Error calling irq_attach\n");
  }

  adc_initialize();

  adc_enable();

  dma_initialize();

  adc_start();

  // Enable ADC interrupt handler
  up_enable_irq(STM32_IRQ_ADC);

  // ADC with DMA should be running at this point
  syslog(1, "--> Exiting ADC config\n"); usleep(20 * 1000);
}


//===================================================================
static int adc_test_create_testing_thread(void)
{
  int thread_id = kthread_create("ADC Test",
                                100,      // Priority
                                4096,     // Stack
                                (main_t) adc_test_kthread_func,
                                (char *const *) NULL);
  if (thread_id <= 0)
  {
    syslog(LOG_ERR, "%s@%d-Creation of %s kthread FAILED\n",
              __FILE__, __LINE__, "ADC Test Thread");
    return -ENOEXEC;
  }
  return OK;
}

//===================================================================
void *adc_test_kthread_func(int argc, char *argv[])
{
#if ADC_TESTS_USE_DOUBLE_BUFFERING > 0
  uint32_t regval;
#endif

  // Check the ADC data register periodically
  // Assume ADC1
  // uint32_t baseADCAddr = STM32_ADC1_BASE;

  for(int chkCnt = 0; chkCnt < 1000000; chkCnt++)
  {
#if ADC_TESTS_USE_DOUBLE_BUFFERING > 0
    uint16_t *inactiveBuf;
    regval = getreg32(STM32_DMA2_S0CR);
    // Read the inacvite buffer
    if((regval & DMA_SCR_CT) == 0)
    {
      syslog(1, "%04d-Buffer1 ADC:%05u %05u %05u %05u %05u %05u\n",
                chkCnt,
                _dmaDataBuffer1[0],  _dmaDataBuffer1[1],
                _dmaDataBuffer1[2],  _dmaDataBuffer1[3],
                _dmaDataBuffer1[4],  _dmaDataBuffer1[5]);
    }
    else
    {
      syslog(1, "%04d-Buffer2 ADC:%05u %05u %05u %05u %05u %05u\n",
                chkCnt,
                _dmaDataBuffer2[0],  _dmaDataBuffer2[1],
                _dmaDataBuffer2[2],  _dmaDataBuffer2[3],
                _dmaDataBuffer2[4],  _dmaDataBuffer2[5]);
    }
#else
    // For converting 6 values
    syslog(1, "%04d-ADC values:%05u %05u %05u %05u %05u %05u\n", chkCnt,
              _dmaDataBuffer1[0], _dmaDataBuffer1[1],
              _dmaDataBuffer1[2], _dmaDataBuffer1[3],
              _dmaDataBuffer1[4], _dmaDataBuffer1[5]);
#endif
    
    usleep(1000 * 1000);
  }
  return NULL;
}

#endif  // #if defined (CONFIG_ADC_TESTS)
